app/Repositories/MarketRepository.php

select * from `markets` inner join `user_markets` on `market_id` = `markets`.`id` where `user_markets`.`user_id` = 2 and `markets`.`active` = '1'
---
    public function myActiveMarkets()
    {
        return Market::join("user_markets", "market_id", "=", "markets.id")
            ->where('user_markets.user_id', auth()->id())
            ->where('markets.active','=','1')->get();