app/Repositories/UploadRepository.php

select * from `uploads` where `uuid` = '7d8fe07f-cf3d-4b52-a3db-588724df429f' limit 1
---
    public function getByUuid($uuid = '')
    {
        $uploadModel = Upload::query()->where('uuid', $uuid)->first();

select * from `media` where `model_type` = 'App\Models\Upload' and `collection_name` = 'image' order by `id` desc
---
    public function allMedia($collection = null)
    {
        $medias = Media::where('model_type', '=', 'App\Models\Upload');
        if ($collection) {
            $medias = $medias->where('collection_name', $collection);
        }
        $medias = $medias->orderBy('id','desc')->get();

select `collection_name` from `media`
---
    public function collectionsNames()
    {
        $medias = Media::all('collection_name')->pluck('collection_name','collection_name')->map(function ($c) {
                return ['value' => $c,
                    'title' => title_case(preg_replace('/_/', ' ', $c))
                ];
        })->unique();